#### VelocityPressure Property

---

|  |
| --- |
| PipePressureDropData Class   See Also |

The velocity pressure of the pipe. Units: (kg/(ftÂ·sÂ²))

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double VelocityPressure { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property VelocityPressure As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double VelocityPressure { 	double get (); 	void set (double value); } ``` |

# See Also

PipePressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace